# Pandas- Operations

In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame({'col1':[1,2,3,4],
                  'col2':[444,555,666,444],
                  'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [3]:
#finding unique value in column
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [4]:
#finding length of the unique value in column
len(df['col2'].unique())

3

In [5]:
#method to count how many unique value has occured in column
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [7]:
df['col1']>2 #returns boolean value

0    False
1    False
2     True
3     True
Name: col1, dtype: bool

In [9]:
df[df['col1']>2] #returns true data

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [11]:
#now using and operator to return values
df[(df['col1']>2) & (df['col2'] == 444)]

   col1  col2 col3
3     4   444  xyz

In [12]:
#now applying function to column 
def times2(x):
    return x*2
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [14]:
#now applying build in function
df['col3'].apply(len)
#this returns the length of the string

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [15]:
#using lambda expression instead of functions
df['col2'].apply(lambda x: x*2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [16]:
#for deleting the column use drop function
df.drop('col1',axis = 1)
#for permanent deletion apply inplace = 'true' statement

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [17]:
# retrivling the list of columns name
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [18]:
# for indexs
df.index

RangeIndex(start=0, stop=4, step=1)

In [20]:
#sorting the dataframane
df.sort_values('col2')
#this will sort df according to column 2

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [21]:
#finding null vaues
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [23]:
df.notnull()

   col1  col2  col3
0  True  True  True
1  True  True  True
2  True  True  True
3  True  True  True

# using pivot table

In [24]:
data = {'A':['foo','foo','foo','bat','bat','bat'],
       'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}
df = pd.DataFrame(data)

In [25]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bat  two  y  5
4  bat  one  x  4
5  bat  one  y  1

In [26]:
df.pivot_table(values='D',index = ['A','B'],columns = ['C'])

C          x    y
A   B
bat one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN